# Project 2 Part 3B

In [1]:
## Standard Imports
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
## Importing the OS and JSON Modules
import os,json
# importing plotly
import plotly.express as px
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

In [2]:
basics = pd.read_csv('Data/basic.csv')
basics.info()
basics.head(2)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86979 entries, 0 to 86978
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86979 non-null  object
 1   titleType       86979 non-null  object
 2   primaryTitle    86979 non-null  object
 3   originalTitle   86979 non-null  object
 4   isAdult         86979 non-null  int64
 5   startYear       86979 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  86979 non-null  int64
 8   genres          86979 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 6.0+ MB

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama

In [3]:
# create new column with a list of split genres
basics['genres_split'] = basics['genres'].str.split(',')
basics.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]

In [4]:
# separate the genres into rows
exploded_genres = basics.explode('genres_split')
exploded_genres.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,Drama

In [5]:
# Save list of unique genres
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [6]:
# save tconst and genres split into title_genres table
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [7]:
# Map out a dictioary for genre ids
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [8]:
# Add genres_id column
title_genres['genres_id'] = title_genres['genres_split'].map(genre_map)
# Drop genres_split column
title_genres = title_genres.drop(columns='genres_split')
# display title_genres 
title_genres.head()

      tconst  genres_id
0  tt0035423          5
0  tt0035423          9
0  tt0035423         18
1  tt0062336          7
2  tt0069049          7

In [9]:
# rename tconst column
rename_tconst = {'tconst':'title_basics_tconst'}
title_genres = title_genres.rename(rename_tconst, axis=1)
title_genres

      title_basics_tconst  genres_id
0               tt0035423          5
0               tt0035423          9
0               tt0035423         18
1               tt0062336          7
2               tt0069049          7
...                   ...        ...
86977           tt9916190          0
86977           tt9916190          2
86977           tt9916190         22
86978           tt9916362          7
86978           tt9916362         11

[162600 rows x 2 columns]

In [10]:
with open('/Users/klein/.secret/tmdb_api.json')as f:
    login = json.load(f)
    
login.keys()

dict_keys(['api-key', 'api-token'])

In [11]:
connection_str = "mysql+pymysql://root:root@localhost/movies"
engine = create_engine(connection_str)
conn = engine.connect()

In [12]:

# Create data frame and insert noramlized genre data
genres = pd.DataFrame({'genre_name': genre_map.keys(),
                      'genre_id':genre_map.values()})
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [13]:
tmdb_data_raw =pd.read_csv('Data/tmdb_results_combined.csv.gz') 
tmdb_data_raw.info()
tmdb_data_raw.head(2)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 726 entries, 0 to 725
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                726 non-null    object
 1   adult                  726 non-null    float64
 2   backdrop_path          610 non-null    object
 3   belongs_to_collection  122 non-null    object
 4   budget                 726 non-null    float64
 5   genres                 726 non-null    object
 6   homepage               114 non-null    object
 7   id                     726 non-null    float64
 8   original_language      726 non-null    object
 9   original_title         726 non-null    object
 10  overview               723 non-null    object
 11  popularity             726 non-null    float64
 12  poster_path            700 non-null    object
 13  production_companies   726 non-null    object
 14  production_countries   726 non-null    object
 15  release_date           725 non-null    object
 16  revenue                726 non-null    float64
 17  runtime                726 non-null    float64
 18  spoken_languages       726 non-null    object
 19  status                 726 non-null    object
 20  tagline                546 non-null    object
 21  title                  726 non-null    object
 22  video                  726 non-null    float64
 23  vote_average           726 non-null    float64
 24  vote_count             726 non-null    float64
 25  certification          473 non-null    object
dtypes: float64(9), object(17)
memory usage: 147.6+ KB

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0035423,0.0,/tJLV3BAlHOgscVOrA99Wnb2gAef.jpg,NaN,48000000.0,"[{'id': 10749, 'name': 'Romance'}, {'id': 14, ...",NaN,11232.0,en,Kate & Leopold,...,76019048.0,118.0,"[{'english_name': 'French', 'iso_639_1': 'fr',...",Released,"If they lived in the same century, they'd be p...",Kate & Leopold,0.0,6.319,1238.0,PG-13
1,tt0118589,0.0,/9NZAirJahVilTiDNCHLFcdkwkiy.jpg,NaN,22000000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10402, 'n...",NaN,10696.0,en,Glitter,...,5271666.0,104.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,"In music she found her dream, her love, herself.",Glitter,0.0,4.405,132.0,PG-13

In [14]:
cols_to_drop = ['adult','backdrop_path','belongs_to_collection','genres','homepage','id','original_language','original_title','overview','popularity','poster_path','production_companies','production_countries','release_date','runtime','spoken_languages','status','tagline','title','video','vote_average','vote_count']
tmdb_data=tmdb_data_raw.drop(columns=cols_to_drop)
tmdb_data.info()
tmdb_data.head(2)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 726 entries, 0 to 725
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        726 non-null    object
 1   budget         726 non-null    float64
 2   revenue        726 non-null    float64
 3   certification  473 non-null    object
dtypes: float64(2), object(2)
memory usage: 22.8+ KB

     imdb_id      budget     revenue certification
0  tt0035423  48000000.0  76019048.0         PG-13
1  tt0118589  22000000.0   5271666.0         PG-13

In [15]:
# Load df to sql
# tmdb_data.to_sql('tmdb_data', engine, index=False, if_exists='append')

In [16]:
from sqlalchemy.types import *
# Make dictionary with column and datatype
tmdb_dict = {"imdb_id":CHAR(12),
            "revenue":FLOAT(),
            "budget":FLOAT(),
            "certification":VARCHAR(7)}

In [17]:
tmdb = tmdb_data_raw[['imdb_id','certification', 'revenue', 'budget']]

In [18]:
# save to sql 
tmdb.to_sql('tmdb_data', conn, dtype=tmdb_dict, if_exists='replace', index=False)     # commented out to avoid integrity error if ran

726

In [19]:
q = """SHOW TABLES;"""
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres
4        tmdb_data

In [20]:
#display genres db info
q = '''DESCRIBE genres;'''
describe_g = pd.read_sql(q, conn)
describe_g

        Field         Type Null  Key Default Extra
0    genre_id          int   NO  PRI    None
1  genre_name  varchar(45)  YES         None

In [21]:
#display ratings db info
q = '''DESCRIBE ratings;'''
describe_r = pd.read_sql(q, conn)
describe_r

           Field         Type Null  Key Default Extra
0         tconst  varchar(10)   NO  PRI    None
1  averageRating  varchar(45)  YES         None
2       numVotes          int  YES         None

In [22]:
#display title_basics db info
q = '''DESCRIBE title_basics;'''
describe_tb = pd.read_sql(q, conn)
describe_tb

            Field          Type Null  Key Default Extra
0          tconst   varchar(10)   NO  PRI    None
1    primaryTitle  varchar(242)  YES         None
2       startYear           int  YES         None
3  runtimeMinutes           int  YES         None

In [23]:
#display title_genres db info
q = '''DESCRIBE title_genres;'''
describe_tg = pd.read_sql(q, conn)
describe_tg

      Field         Type Null  Key Default Extra
0    tconst  varchar(10)   NO  PRI    None
1  genre_id          int   NO  PRI    None

In [24]:
#display tmdb_data db info
q = '''DESCRIBE tmdb_data;'''
describe_td = pd.read_sql(q, conn)
describe_td

           Field        Type Null Key Default Extra
0        imdb_id    char(12)  YES        None
1  certification  varchar(7)  YES        None
2        revenue       float  YES        None
3         budget       float  YES        None

In [25]:
# Confirm data has been added
q = """
SELECT * FROM genres
LIMIT 5;
"""
pd.read_sql(q,engine)

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

In [26]:
# Confirm data has been added
q = """
SELECT * FROM ratings
LIMIT 5;
"""
pd.read_sql(q,engine)

Empty DataFrame
Columns: [tconst, averageRating, numVotes]
Index: []

In [27]:
# Confirm data has been added
q = """
SELECT * FROM title_basics
LIMIT 5;
"""
pd.read_sql(q,engine)

Empty DataFrame
Columns: [tconst, primaryTitle, startYear, runtimeMinutes]
Index: []

In [28]:
# Confirm data has been added
q = """
SELECT * FROM title_genres
LIMIT 5;
"""
pd.read_sql(q,engine)

Empty DataFrame
Columns: [tconst, genre_id]
Index: []

In [29]:
# Confirm data has been added
q = """
SELECT * FROM tmdb_data
LIMIT 5;
"""
pd.read_sql(q,engine)

     imdb_id certification     revenue      budget
0  tt0035423         PG-13  76019000.0  48000000.0
1  tt0118589         PG-13   5271670.0  22000000.0
2  tt0118652             R         0.0   1000000.0
3  tt0119004          None      6297.0         0.0
4  tt0120681             R  74558100.0  35000000.0